darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/**
 *	@file TLE9210x_FuncLayer.c
 *	@author Infineon Technologies AG
 *	@date 11.09.2023
 *	@brief TLE9210x specific device driver implementation from Infineon Technologies AG.
 *
 ************************************************************************
 *
 * Copyright (c) 2023, Infineon Technologies AG
 * All rights reserved.
 *
 ************************************************************************
 */

/** \addtogroup TLE9210x_FUNCTION_LAYER
 *  @{
 */

/************************************************************************
**                             Includes                                **
************************************************************************/
#include "TLE9210x_FuncLayer.h"
#include "TLE9210x_ApplLayer.h"


/************************************************************************
**                      Local Macro Definitions                        **
************************************************************************/
//#define TLE92104 4

/************************************************************************
**                      Local Type Definitions                         **
************************************************************************/

/************************************************************************
**                    Local Variable Definitions                       **
************************************************************************/

/************************************************************************
**                    Local Function Definitions                       **
************************************************************************/

/************************************************************************
**                    Global Variable Definitions                      **
************************************************************************/

/************************************************************************
**                    Global Function Definitions                      **
************************************************************************/

/** \brief Set Direction of current sense amplifier 2
*
*   \note  Value: 0b0b - The current sense is unidirectional
*   \note  Value: 0b1b - The current sense is bidirectional
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_CSD2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_CSD2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_CSD2_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_CSD2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Direction of current sense amplifier 2
*
*   \note  Value: 0b0b - The current sense is unidirectional
*   \note  Value: 0b1b - The current sense is bidirectional
*
*   \return CSD2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_CSD2(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.CSD2;
}

/** \brief Set Gain of current sense amplifier 2
*
*   \note  Value: 0b00b - 10 V/V (default)
*   \note  Value: 0b01b - 20 V/V
*   \note  Value: 0b10b - 40 V/V
*   \note  Value: 0b11b - 80 V/V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_CSAG2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_CSAG2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_CSAG2_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_CSAG2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Gain of current sense amplifier 2
*
*   \note  Value: 0b00b - 10 V/V (default)
*   \note  Value: 0b01b - 20 V/V
*   \note  Value: 0b10b - 40 V/V
*   \note  Value: 0b11b - 80 V/V
*
*   \return CSAG2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_CSAG2(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.CSAG2;
}

/** \brief Set Direction of current sense amplifier 1
*
*   \note  Value: 0b0b - The current sense is unidirectional (default)
*   \note  Value: 0b1b - The current sense is bidirectional
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_CSD1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_CSD1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_CSD1_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_CSD1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Direction of current sense amplifier 1
*
*   \note  Value: 0b0b - The current sense is unidirectional (default)
*   \note  Value: 0b1b - The current sense is bidirectional
*
*   \return CSD1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_CSD1(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.CSD1;
}

