darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Gain of current sense amplifier 1
*
*   \note  Value: 0b00b - 10 V/V (default)
*   \note  Value: 0b01b - 20 V/V
*   \note  Value: 0b10b - 40 V/V
*   \note  Value: 0b11b - 80 V/V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_CSAG1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_CSAG1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_CSAG1_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_CSAG1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Gain of current sense amplifier 1
*
*   \note  Value: 0b00b - 10 V/V (default)
*   \note  Value: 0b01b - 20 V/V
*   \note  Value: 0b10b - 40 V/V
*   \note  Value: 0b11b - 80 V/V
*
*   \return CSAG1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_CSAG1(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.CSAG1;
}

/** \brief Set Register banking
*
*   \note  Value: 0b0b - (Default)
*   \note  Value: 0b1b - REG_BANK = 1
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_REG_BANK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_REG_BANK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_REG_BANK_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_REG_BANK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Register banking
*
*   \note  Value: 0b0b - (Default)
*   \note  Value: 0b1b - REG_BANK = 1
*
*   \return REG_BANK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_REG_BANK(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.REG_BANK;
}

/** \brief Set VS Overvoltage threshold
*
*   \note  Value: 0b0b - V_SOVOFF = V_SOVOFF1 (min. 19V, default)
*   \note  Value: 0b1b - V_SOVOFF = V_SOVOFF2 (min. 29V)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_VSOVTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_VSOVTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_VSOVTH_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_VSOVTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get VS Overvoltage threshold
*
*   \note  Value: 0b0b - V_SOVOFF = V_SOVOFF1 (min. 19V, default)
*   \note  Value: 0b1b - V_SOVOFF = V_SOVOFF2 (min. 29V)
*
*   \return VSOVTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_VSOVTH(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.VSOVTH;
}

/** \brief Set Unlock bit to disable the watchdog
*
*   \note  Value: 0b0b - WDDIS cannot be reset (default)
*   \note  Value: 0b1b - WDDIS (GENCTRL2) can be reset in the following SPI frame
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_UNLOCK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_UNLOCK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_UNLOCK_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_UNLOCK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Unlock bit to disable the watchdog
*
*   \note  Value: 0b0b - WDDIS cannot be reset (default)
*   \note  Value: 0b1b - WDDIS (GENCTRL2) can be reset in the following SPI frame
*
*   \return UNLOCK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_UNLOCK(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.UNLOCK;
}

/** \brief Set Frequency modulation
*
*   \note  Value: 0b0b - No modulation
*   \note  Value: 0b1b - Modulation frequency 15.6 kHz (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_FMODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_FMODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_FMODE_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_FMODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Frequency modulation
*
*   \note  Value: 0b0b - No modulation
*   \note  Value: 0b1b - Modulation frequency 15.6 kHz (default)
*
*   \return FMODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_FMODE(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.FMODE;
}

/** \brief Set Adaptation of the pre-charge and pre-discharge current
*
*   \note  Value: 0b0b - 1 current step (default)
*   \note  Value: 0b1b - 2 current steps
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_IPCHGADT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_IPCHGADT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_IPCHGADT_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_IPCHGADT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Adaptation of the pre-charge and pre-discharge current
*
*   \note  Value: 0b0b - 1 current step (default)
*   \note  Value: 0b1b - 2 current steps
*
*   \return IPCHGADT value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_IPCHGADT(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.IPCHGADT;
}

/** \brief Set Overcurrent shutdown Enable
*
*   \note  Value: 0b0b - Disabled
*   \note  Value: 0b1b - Enabled (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_OCEN(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_OCEN_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_OCEN_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_OCEN_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Overcurrent shutdown Enable
*
*   \note  Value: 0b0b - Disabled
*   \note  Value: 0b1b - Enabled (default)
*
*   \return OCEN value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_OCEN(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.OCEN;
}

/** \brief Set Watchdog period
*
*   \note  Value: 0b0b - 50 ms
*   \note  Value: 0b1b - 200 ms (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_WDPER(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_WDPER_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_WDPER_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_WDPER_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Watchdog period
*
*   \note  Value: 0b0b - 50 ms
*   \note  Value: 0b1b - 200 ms (default)
*
*   \return WDPER value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_WDPER(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.WDPER;
}

/** \brief Set Watchdog trigger bit
*
*   \note  Value: 0b0b - After power on reset, the default value is 0
*   \note  Value: 0b1b - This bit is inverted within a watchdog period
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1_WDTRIG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL1_WDTRIG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL1_WDTRIG_Pos) & (uint16_t)TLE9210x_Control_GENCTRL1_WDTRIG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Watchdog trigger bit
*
*   \note  Value: 0b0b - After power on reset, the default value is 0
*   \note  Value: 0b1b - This bit is inverted within a watchdog period
*
*   \return WDTRIG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL1_WDTRIG(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL1.bit.WDTRIG;
}

/** \brief Set General Control Register 1 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Postcharge disable bit
*
*   \note  Value: 0b0b - The postcharge is enabled during PWM (defaultO
*   \note  Value: 0b1b - The postcharge is disabled during PWM
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_POCHGDIS(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_POCHGDIS_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_POCHGDIS_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_POCHGDIS_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Postcharge disable bit
*
*   \note  Value: 0b0b - The postcharge is enabled during PWM (defaultO
*   \note  Value: 0b1b - The postcharge is disabled during PWM
*
*   \return POCHGDIS value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_POCHGDIS(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.POCHGDIS;
}

/** \brief Set Bridge driver passive mode
*
*   \note  Value: 0b0b - Bridge driver is in active mode
*   \note  Value: 0b1b - Bridge driver is in passive mode (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_BD_PASS(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_BD_PASS_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_BD_PASS_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_BD_PASS_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

