darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Bridge driver passive mode
*
*   \note  Value: 0b0b - Bridge driver is in active mode
*   \note  Value: 0b1b - Bridge driver is in passive mode (default)
*
*   \return BD_PASS value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_BD_PASS(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.BD_PASS;
}

/** \brief Set Filter for adaptive gate control
*
*   \note  Value: 0b0b - No filter applied (default)
*   \note  Value: 0b1b - Filter applied
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_AGCFILT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_AGCFILT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_AGCFILT_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_AGCFILT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Filter for adaptive gate control
*
*   \note  Value: 0b0b - No filter applied (default)
*   \note  Value: 0b1b - Filter applied
*
*   \return AGCFILT value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_AGCFILT(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.AGCFILT;
}

/** \brief Set Adaptive gate control
*
*   \note  Value: 0b00b - (default) Adaptive gate control disabled, pre-charge and predischarge disabled
*   \note  Value: 0b01b - Adaptive gate control disabled, precharge is disabled, predischarge is enabled with IPREDCHG = IPDCHGINIT
*   \note  Value: 0b10b - Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted
*   \note  Value: 0b11b - Reserved. Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_AGC(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_AGC_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_AGC_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_AGC_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Adaptive gate control
*
*   \note  Value: 0b00b - (default) Adaptive gate control disabled, pre-charge and predischarge disabled
*   \note  Value: 0b01b - Adaptive gate control disabled, precharge is disabled, predischarge is enabled with IPREDCHG = IPDCHGINIT
*   \note  Value: 0b10b - Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted
*   \note  Value: 0b11b - Reserved. Adaptive gate control enabled, IPRECHG and IPREDCHG are self adapted
*
*   \return AGC value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_AGC(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.AGC;
}

/** \brief Set Gate driver hold current IHOLD
*
*   \note  Value: 0b0b - (default) Charge: I_CHG8 (12.5 mA typ.), discharge I_DCHG8 (14.2 mA typ.)
*   \note  Value: 0b1b - Charge: I_CHG12 (23.9 mA typ.), discharge: I_DCHG12 (26.0 mA typ.)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_IHOLD(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_IHOLD_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_IHOLD_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_IHOLD_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Gate driver hold current IHOLD
*
*   \note  Value: 0b0b - (default) Charge: I_CHG8 (12.5 mA typ.), discharge I_DCHG8 (14.2 mA typ.)
*   \note  Value: 0b1b - Charge: I_CHG12 (23.9 mA typ.), discharge: I_DCHG12 (26.0 mA typ.)
*
*   \return IHOLD value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_IHOLD(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.IHOLD;
}

/** \brief Set Watchdog disable bit
*
*   \note  Value: 0b0b - The watchdog is enabled (default)
*   \note  Value: 0b1b - The watchdog is disabled if the previous SPI frame has set UNLOCK bit (GENCTRL1)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_WDDIS(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_WDDIS_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_WDDIS_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_WDDIS_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Watchdog disable bit
*
*   \note  Value: 0b0b - The watchdog is enabled (default)
*   \note  Value: 0b1b - The watchdog is disabled if the previous SPI frame has set UNLOCK bit (GENCTRL1)
*
*   \return WDDIS value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_WDDIS(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.WDDIS;
}

