darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Masking of the turn-on/off delay error in the Global Error Flag
*
*   \note  Value: 0b0b - Turn-on/off delay error is reported in the GEF
*   \note  Value: 0b1b - Turn-on/off delay error is masked in the GEF (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_MSKTDREG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_MSKTDREG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_MSKTDREG_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_MSKTDREG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Masking of the turn-on/off delay error in the Global Error Flag
*
*   \note  Value: 0b0b - Turn-on/off delay error is reported in the GEF
*   \note  Value: 0b1b - Turn-on/off delay error is masked in the GEF (default)
*
*   \return MSKTDREG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_MSKTDREG(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.MSKTDREG;
}

/** \brief Set Charge pump undervoltage detection threshold
*
*   \note  Value: 0b0b - V_CPUV (referred to VS) = 6.0 V typ.
*   \note  Value: 0b1b - V_CPUV (referred to VS) = 7.5 V typ. (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_CPUVTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_CPUVTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_CPUVTH_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_CPUVTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Charge pump undervoltage detection threshold
*
*   \note  Value: 0b0b - V_CPUV (referred to VS) = 6.0 V typ.
*   \note  Value: 0b1b - V_CPUV (referred to VS) = 7.5 V typ. (default)
*
*   \return CPUVTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_CPUVTH(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.CPUVTH;
}

/** \brief Set Automatic switch-over between dual and single charge pump stage
*
*   \note  Value: 0b0b - Automatic switch over deactivated (default)
*   \note  Value: 0b1b - Automatic switch over activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_CPSTGA(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_CPSTGA_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_CPSTGA_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_CPSTGA_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Automatic switch-over between dual and single charge pump stage
*
*   \note  Value: 0b0b - Automatic switch over deactivated (default)
*   \note  Value: 0b1b - Automatic switch over activated
*
*   \return CPSTGA value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_CPSTGA(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.CPSTGA;
}

/** \brief Set Filter time of drain-souce voltage monitoring
*
*   \note  Value: 0b00b - 0.5 µs (default)
*   \note  Value: 0b01b - 1 µs
*   \note  Value: 0b10b - 2 µs
*   \note  Value: 0b11b - 3 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_TFVDS(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_TFVDS_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_TFVDS_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_TFVDS_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Filter time of drain-souce voltage monitoring
*
*   \note  Value: 0b00b - 0.5 µs (default)
*   \note  Value: 0b01b - 1 µs
*   \note  Value: 0b10b - 2 µs
*   \note  Value: 0b11b - 3 µs
*
*   \return TFVDS value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_TFVDS(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.TFVDS;
}

/** \brief Set Overcurrent detection threshold of CSO2 with CSD2 = 0/1
*
*   \note  Value: 0b00b - If the CSD2-Value is 0, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD2-Value is 0, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD2-Value is 0, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD2-Value is 0, the appropriate option 4 is used - For more Information see the datasheet
*   \note  Value: 0b00b - If the CSD2-Value is 1, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD2-Value is 1, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD2-Value is 1, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD2-Value is 1, the appropriate option 4 is used - For more Information see the datasheet
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_OCTH2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_OCTH2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_OCTH2_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_OCTH2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Overcurrent detection threshold of CSO2 with CSD2 = 0/1
*
*   \note  Value: 0b00b - If the CSD2-Value is 0, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD2-Value is 0, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD2-Value is 0, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD2-Value is 0, the appropriate option 4 is used - For more Information see the datasheet
*   \note  Value: 0b00b - If the CSD2-Value is 1, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD2-Value is 1, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD2-Value is 1, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD2-Value is 1, the appropriate option 4 is used - For more Information see the datasheet
*
*   \return OCTH2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_OCTH2(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.OCTH2;
}

/** \brief Set Overcurrent detection threshold of CSO1 with CSD1 = 0/1
*
*   \note  Value: 0b00b - If the CSD1-Value is 0, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD1-Value is 0, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD1-Value is 0, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD1-Value is 0, the appropriate option 4 is used - For more Information see the datasheet
*   \note  Value: 0b00b - If the CSD1-Value is 1, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD1-Value is 1, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD1-Value is 1, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD1-Value is 1, the appropriate option 4 is used - For more Information see the datasheet
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2_OCTH1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_GENCTRL2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_GENCTRL2_OCTH1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_GENCTRL2_OCTH1_Pos) & (uint16_t)TLE9210x_Control_GENCTRL2_OCTH1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Overcurrent detection threshold of CSO1 with CSD1 = 0/1
*
*   \note  Value: 0b00b - If the CSD1-Value is 0, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD1-Value is 0, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD1-Value is 0, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD1-Value is 0, the appropriate option 4 is used - For more Information see the datasheet
*   \note  Value: 0b00b - If the CSD1-Value is 1, the appropriate option 1 is used - For more Information see the datasheet (default)
*   \note  Value: 0b01b - If the CSD1-Value is 1, the appropriate option 2 is used - For more Information see the datasheet
*   \note  Value: 0b10b - If the CSD1-Value is 1, the appropriate option 3 is used - For more Information see the datasheet
*   \note  Value: 0b11b - If the CSD1-Value is 1, the appropriate option 4 is used - For more Information see the datasheet
*
*   \return OCTH1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_GENCTRL2_OCTH1(void)
{
	return (uint16_t)TLE9210x->Control_GENCTRL2.bit.OCTH1;
}

/** \brief Set General Control Register 2 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_GENCTRL2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_GENCTRL2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set HS4 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH4 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH4
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB4D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB4D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB4D_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB4D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HS4 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH4 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH4
*
*   \return HB4D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB4D(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB4D;
}

/** \brief Set HS3 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH3 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH3
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB3D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB3D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB3D_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB3D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HS3 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH3 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH3
*
*   \return HB3D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB3D(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB3D;
}

/** \brief Set HS2 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH2 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN-VSH2
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB2D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB2D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB2D_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB2D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HS2 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH2 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN-VSH2
*
*   \return HB2D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB2D(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB2D;
}

/** \brief Set HS1 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH1 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH1
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB1D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB1D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB1D_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB1D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HS1 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH1 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH1
*
*   \return HB1D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB1D(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB1D;
}

/** \brief Set HB4 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB4VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB4VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB4VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB4VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

