darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get HB4 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB4VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB4VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB4VDSTH;
}

/** \brief Set HB3 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB3VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB3VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB3VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB3VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HB3 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB3VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB3VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB3VDSTH;
}

/** \brief Set HB2 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB2VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB2VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB2VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB2VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HB2 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB2VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB2VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB2VDSTH;
}

/** \brief Set HB1 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1_HB1VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS1_HB1VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS1_HB1VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS1_HB1VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get HB1 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB1VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS1_HB1VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS1.bit.HB1VDSTH;
}

/** \brief Set Drain-source monitoring HB1-4 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS1;
		u8_success = 1;
	}
	return u8_success;
}

#if TLE9210x_Variant == TLE92108
/** \brief Set HS8 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH8 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH8
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB8D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB8D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB8D_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB8D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

