darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get HS8 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH8 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH8
*
*   \return HB8D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB8D(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB8D;
}
#endif

/** \brief Set HS7 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH7 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH7
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
#if TLE9210x_Variant == TLE92108
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB7D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB7D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB7D_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB7D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HS7 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH7 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH7
*
*   \return HB7D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB7D(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB7D;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HS6 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH6 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN-VSH6
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB6D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB6D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB6D_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB6D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HS6 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH6 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN-VSH6
*
*   \return HB6D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB6D(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB6D;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HS5 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH5 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH5
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB5D(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB5D_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB5D_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB5D_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HS5 Drain-source monitoring
*
*   \note  Value: 0b0b - Drain-source monitoring: DH-VSH5 (default)
*   \note  Value: 0b1b - Drain-source monitoring: CSIN1-VSH5
*
*   \return HB5D value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB5D(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB5D;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB8 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB8VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB8VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB8VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB8VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB8 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB8VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB8VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB8VDSTH;
}
#endif

