darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Set HB7 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB7VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB7VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB7VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB7VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB7 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB7VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB7VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB7VDSTH;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB6 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB6VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB6VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB6VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB6VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB6 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB6VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB6VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB6VDSTH;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB5 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2_HB5VDSTH(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_VDS2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_VDS2_HB5VDSTH_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_VDS2_HB5VDSTH_Pos) & (uint16_t)TLE9210x_Control_VDS2_HB5VDSTH_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB5 drain-source overvoltage threshold
*
*   \note  Value: 0b000b - 0.15 V
*   \note  Value: 0b001b - 0.20 V (default)
*   \note  Value: 0b010b - 0.25 V
*   \note  Value: 0b011b - 0.30 V
*   \note  Value: 0b100b - 0.40 V
*   \note  Value: 0b101b - 0.50 V
*   \note  Value: 0b110b - 0.60 V
*   \note  Value: 0b111b - 2.0 V
*
*   \return HB5VDSTH value
*/
uint16_t TLE9210x_FuncLayer_get_Control_VDS2_HB5VDSTH(void)
{
	return (uint16_t)TLE9210x->Control_VDS2.bit.HB5VDSTH;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Drain-source monitoring threshold HB5-8 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_VDS2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_VDS2;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Cross-current protection and blank times applied to HB8
*
*   \note  Value: 0b00b - (tHB8CCP, tHB8BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB8CCP, tHB8BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB8CCP, tHB8BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB8CCP, tHB8BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB8CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB8CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB8CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB8CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}
#endif

