darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get Cross-current protection and blank times applied to HB8
*
*   \note  Value: 0b00b - (tHB8CCP, tHB8BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB8CCP, tHB8BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB8CCP, tHB8BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB8CCP, tHB8BLANK) = (tCCP4, tBLANK4)
*
*   \return HB8CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB8CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB8CCPBLK;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Cross-current protection and blank times applied to HB7
*
*   \note  Value: 0b00b - (tHB7CCP, tHB7BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB7CCP, tHB7BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB7CCP, tHB7BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB7CCP, tHB7BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB7CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB7CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB7CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB7CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Cross-current protection and blank times applied to HB7
*
*   \note  Value: 0b00b - (tHB7CCP, tHB7BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB7CCP, tHB7BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB7CCP, tHB7BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB7CCP, tHB7BLANK) = (tCCP4, tBLANK4)
*
*   \return HB7CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB7CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB7CCPBLK;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Cross-current protection and blank times applied to HB6
*
*   \note  Value: 0b00b - (tHB6CCP, tHB6BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB6CCP, tHB6BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB6CCP, tHB6BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB6CCP, tHB6BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB6CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB6CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB6CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB6CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Cross-current protection and blank times applied to HB6
*
*   \note  Value: 0b00b - (tHB6CCP, tHB6BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB6CCP, tHB6BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB6CCP, tHB6BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB6CCP, tHB6BLANK) = (tCCP4, tBLANK4)
*
*   \return HB6CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB6CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB6CCPBLK;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Cross-current protection and blank times applied to HB5
*
*   \note  Value: 0b00b - (tHB5CCP, tHB5BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB5CCP, tHB5BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB5CCP, tHB5BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB5CCP, tHB5BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB5CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB5CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB5CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB5CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Cross-current protection and blank times applied to HB5
*
*   \note  Value: 0b00b - (tHB5CCP, tHB5BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB5CCP, tHB5BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB5CCP, tHB5BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB5CCP, tHB5BLANK) = (tCCP4, tBLANK4)
*
*   \return HB5CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB5CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB5CCPBLK;
}
#endif

/** \brief Set Cross-current protection and blank times applied to HB4
*
*   \note  Value: 0b00b - (tHB4CCP, tHB4BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB4CCP, tHB4BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB4CCP, tHB4BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB4CCP, tHB4BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB4CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB4CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB4CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB4CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Cross-current protection and blank times applied to HB4
*
*   \note  Value: 0b00b - (tHB4CCP, tHB4BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB4CCP, tHB4BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB4CCP, tHB4BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB4CCP, tHB4BLANK) = (tCCP4, tBLANK4)
*
*   \return HB4CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB4CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB4CCPBLK;
}

/** \brief Set Cross-current protection and blank times applied to HB3
*
*   \note  Value: 0b00b - (tHB3CCP, tHB3BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB3CCP, tHB3BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB3CCP, tHB3BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB3CCP, tHB3BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB3CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB3CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB3CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB3CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Cross-current protection and blank times applied to HB3
*
*   \note  Value: 0b00b - (tHB3CCP, tHB3BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB3CCP, tHB3BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB3CCP, tHB3BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB3CCP, tHB3BLANK) = (tCCP4, tBLANK4)
*
*   \return HB3CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB3CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB3CCPBLK;
}

