darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Cross-current protection and blank times applied to HB2
*
*   \note  Value: 0b00b - (tHB2CCP, tHB2BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB2CCP, tHB2BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB2CCP, tHB2BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB2CCP, tHB2BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB2CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB2CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB2CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB2CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Cross-current protection and blank times applied to HB2
*
*   \note  Value: 0b00b - (tHB2CCP, tHB2BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB2CCP, tHB2BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB2CCP, tHB2BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB2CCP, tHB2BLANK) = (tCCP4, tBLANK4)
*
*   \return HB2CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB2CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB2CCPBLK;
}

/** \brief Set Cross-current protection and blank times applied to HB1
*
*   \note  Value: 0b00b - (tHB1CCP, tHB1BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB1CCP, tHB1BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB1CCP, tHB1BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB1CCP, tHB1BLANK) = (tCCP4, tBLANK4)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1_HB1CCPBLK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK1_HB1CCPBLK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK1_HB1CCPBLK_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK1_HB1CCPBLK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Cross-current protection and blank times applied to HB1
*
*   \note  Value: 0b00b - (tHB1CCP, tHB1BLANK) = (tCCP1, tBLANK1) (default)
*   \note  Value: 0b01b - (tHB1CCP, tHB1BLANK) = (tCCP2, tBLANK2)
*   \note  Value: 0b10b - (tHB1CCP, tHB1BLANK) = (tCCP3, tBLANK3)
*   \note  Value: 0b11b - (tHB1CCP, tHB1BLANK) = (tCCP4, tBLANK4)
*
*   \return HB1CCPBLK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK1_HB1CCPBLK(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK1.bit.HB1CCPBLK;
}

/** \brief Set Cross current protection and blank times setting 1 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Cross-current protection - tCCP3 Active
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_ACT_TCCP3_ACT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_ACT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_ACT_TCCP3_ACT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_ACT_TCCP3_ACT_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_ACT_TCCP3_ACT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Cross-current protection - tCCP3 Active
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TCCP3_ACT value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_ACT_TCCP3_ACT(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_ACT.bit.TCCP3_ACT;
}

/** \brief Set Blank time - tBLANK2 Active
*
*   \note  Value: 0b000b - 625 ns
*   \note  Value: 0b001b - 1000 ns
*   \note  Value: 0b010b - 1250 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_ACT_TBLANK2_ACT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_ACT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_ACT_TBLANK2_ACT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_ACT_TBLANK2_ACT_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_ACT_TBLANK2_ACT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

