darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Cross current protection and blank times setting for active MOSFETs Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_ACT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Set Cross-current protection - tCCP3 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW_TCCP3_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_FW_TCCP3_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP3_FW_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP3_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Cross-current protection - tCCP3 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TCCP3_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_FW_TCCP3_FW(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_FW.bit.TCCP3_FW;
}

/** \brief Set Blank time - tBLANK2 Freewheeling
*
*   \note  Value: 0b000b - 625 ns
*   \note  Value: 0b001b - 1000 ns
*   \note  Value: 0b010b - 1250 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW_TBLANK2_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_FW_TBLANK2_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TBLANK2_FW_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TBLANK2_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Blank time - tBLANK2 Freewheeling
*
*   \note  Value: 0b000b - 625 ns
*   \note  Value: 0b001b - 1000 ns
*   \note  Value: 0b010b - 1250 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TBLANK2_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_FW_TBLANK2_FW(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_FW.bit.TBLANK2_FW;
}

/** \brief Set Cross-current protection - tCCP2 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW_TCCP2_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_FW_TCCP2_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP2_FW_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP2_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Cross-current protection - tCCP2 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TCCP2_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_FW_TCCP2_FW(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_FW.bit.TCCP2_FW;
}

/** \brief Set Blank time - tBLANK1 Freewheeling
*
*   \note  Value: 0b000b - 625 ns
*   \note  Value: 0b001b - 1000 ns
*   \note  Value: 0b010b - 1250 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW_TBLANK1_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_FW_TBLANK1_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TBLANK1_FW_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TBLANK1_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Blank time - tBLANK1 Freewheeling
*
*   \note  Value: 0b000b - 625 ns
*   \note  Value: 0b001b - 1000 ns
*   \note  Value: 0b010b - 1250 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TBLANK1_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_FW_TBLANK1_FW(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_FW.bit.TBLANK1_FW;
}

