darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Cross-current protection - tCCP1 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW_TCCP1_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_CCP_BLK2_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_CCP_BLK2_FW_TCCP1_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP1_FW_Pos) & (uint16_t)TLE9210x_Control_CCP_BLK2_FW_TCCP1_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Cross-current protection - tCCP1 Freewheeling
*
*   \note  Value: 0b000b - 375 ns
*   \note  Value: 0b001b - 625 ns
*   \note  Value: 0b010b - 1000 ns
*   \note  Value: 0b011b - 1500 ns
*   \note  Value: 0b100b - 2000 ns (default)
*   \note  Value: 0b101b - 3000 ns
*   \note  Value: 0b110b - 4000 ns
*   \note  Value: 0b111b - 16000 ns
*
*   \return TCCP1_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_CCP_BLK2_FW_TCCP1_FW(void)
{
	return (uint16_t)TLE9210x->Control_CCP_BLK2_FW.bit.TCCP1_FW;
}

/** \brief Set Cross current protection and blank times setting for FW MOSFETs Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_CCP_BLK2_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_CCP_BLK2_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

#if TLE9210x_Variant == TLE92108
/** \brief Set Half-bridge output 8 mode selection
*
*   \note  Value: 0b00b - HB8 is in high impedance (default)
*   \note  Value: 0b01b - LS8 is ON
*   \note  Value: 0b10b - HS8 is ON
*   \note  Value: 0b11b - Reserved - HB8 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB8MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB8MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB8MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB8MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Half-bridge output 8 mode selection
*
*   \note  Value: 0b00b - HB8 is in high impedance (default)
*   \note  Value: 0b01b - LS8 is ON
*   \note  Value: 0b10b - HS8 is ON
*   \note  Value: 0b11b - Reserved - HB8 is in high impedance
*
*   \return HB8MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB8MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB8MODE;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Half-bridge output 7 mode selection
*
*   \note  Value: 0b00b - HB7 is in high impedance (default)
*   \note  Value: 0b01b - LS7 is ON
*   \note  Value: 0b10b - HS7 is ON
*   \note  Value: 0b11b - Reserved - HB7 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB7MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB7MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB7MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB7MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Half-bridge output 7 mode selection
*
*   \note  Value: 0b00b - HB7 is in high impedance (default)
*   \note  Value: 0b01b - LS7 is ON
*   \note  Value: 0b10b - HS7 is ON
*   \note  Value: 0b11b - Reserved - HB7 is in high impedance
*
*   \return HB7MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB7MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB7MODE;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Half-bridge output 6 mode selection
*
*   \note  Value: 0b00b - HB6 is in high impedance (default)
*   \note  Value: 0b01b - LS6 is ON
*   \note  Value: 0b10b - HS6 is ON
*   \note  Value: 0b11b - Reserved - HB6 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB6MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB6MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB6MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB6MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}
#endif

