darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get Half-bridge output 6 mode selection
*
*   \note  Value: 0b00b - HB6 is in high impedance (default)
*   \note  Value: 0b01b - LS6 is ON
*   \note  Value: 0b10b - HS6 is ON
*   \note  Value: 0b11b - Reserved - HB6 is in high impedance
*
*   \return HB6MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB6MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB6MODE;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Half-bridge output 5 mode selection
*
*   \note  Value: 0b00b - HB5 is in high impedance (default)
*   \note  Value: 0b01b - LS5 is ON
*   \note  Value: 0b10b - HS5 is ON
*   \note  Value: 0b11b - Reserved - HB5 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB5MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB5MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB5MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB5MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Half-bridge output 5 mode selection
*
*   \note  Value: 0b00b - HB5 is in high impedance (default)
*   \note  Value: 0b01b - LS5 is ON
*   \note  Value: 0b10b - HS5 is ON
*   \note  Value: 0b11b - Reserved - HB5 is in high impedance
*
*   \return HB5MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB5MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB5MODE;
}
#endif

/** \brief Set Half-bridge output 4 mode selection
*
*   \note  Value: 0b00b - HB4 is in high impedance (default)
*   \note  Value: 0b01b - LS4 is ON
*   \note  Value: 0b10b - HS4 is ON
*   \note  Value: 0b11b - Reserved - HB4 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB4MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB4MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB4MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB4MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Half-bridge output 4 mode selection
*
*   \note  Value: 0b00b - HB4 is in high impedance (default)
*   \note  Value: 0b01b - LS4 is ON
*   \note  Value: 0b10b - HS4 is ON
*   \note  Value: 0b11b - Reserved - HB4 is in high impedance
*
*   \return HB4MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB4MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB4MODE;
}

/** \brief Set Half-bridge output 3 mode selection
*
*   \note  Value: 0b00b - HB3 is in high impedance (default)
*   \note  Value: 0b01b - LS3 is ON
*   \note  Value: 0b10b - HS3 is ON
*   \note  Value: 0b11b - Reserved - HB3 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB3MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB3MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB3MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB3MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Half-bridge output 3 mode selection
*
*   \note  Value: 0b00b - HB3 is in high impedance (default)
*   \note  Value: 0b01b - LS3 is ON
*   \note  Value: 0b10b - HS3 is ON
*   \note  Value: 0b11b - Reserved - HB3 is in high impedance
*
*   \return HB3MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB3MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB3MODE;
}

/** \brief Set Half-bridge output 2 mode selection
*
*   \note  Value: 0b00b - HB2 is in high impedance (default)
*   \note  Value: 0b01b - LS2 is ON
*   \note  Value: 0b10b - HS2 is ON
*   \note  Value: 0b11b - Reserved - HB2 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB2MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB2MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB2MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB2MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Half-bridge output 2 mode selection
*
*   \note  Value: 0b00b - HB2 is in high impedance (default)
*   \note  Value: 0b01b - LS2 is ON
*   \note  Value: 0b10b - HS2 is ON
*   \note  Value: 0b11b - Reserved - HB2 is in high impedance
*
*   \return HB2MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB2MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB2MODE;
}

/** \brief Set Half-bridge output 1 mode selection
*
*   \note  Value: 0b00b - HB1 is in high impedance (default)
*   \note  Value: 0b01b - LS1 is ON
*   \note  Value: 0b10b - HS1 is ON
*   \note  Value: 0b11b - Reserved - HB1 is in high impedance
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE_HB1MODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBMODE.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBMODE_HB1MODE_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBMODE_HB1MODE_Pos) & (uint16_t)TLE9210x_Control_HBMODE_HB1MODE_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}

