darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Half-bridge output 1 mode selection
*
*   \note  Value: 0b00b - HB1 is in high impedance (default)
*   \note  Value: 0b01b - LS1 is ON
*   \note  Value: 0b10b - HS1 is ON
*   \note  Value: 0b11b - Reserved - HB1 is in high impedance
*
*   \return HB1MODE value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBMODE_HB1MODE(void)
{
	return (uint16_t)TLE9210x->Control_HBMODE.bit.HB1MODE;
}

/** \brief Set Half-bridge mode Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBMODE(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBMODE;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Drain-Source monitoring in bridge passive mode
*
*   \note  Value: 0b0b - DS monitoring in bridge passive mode disabled
*   \note  Value: 0b1b - DS monitoring in bridge passive mode enabled (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PASS_VDS(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PASS_VDS_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PASS_VDS_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PASS_VDS_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get Drain-Source monitoring in bridge passive mode
*
*   \note  Value: 0b0b - DS monitoring in bridge passive mode disabled
*   \note  Value: 0b1b - DS monitoring in bridge passive mode enabled (default)
*
*   \return PASS_VDS value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PASS_VDS(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PASS_VDS;
}

/** \brief Set Settings for bridge driver passive mode
*
*   \note  Value: 0b00b - LS1-4 are always off
*   \note  Value: 0b01b - LS1-4 are always on (static brake)
*   \note  Value: 0b10b - LS1-4 are activated if passive VS OV is detected (overvoltage break) (default)
*   \note  Value: 0b11b - LS1-4 are activated if passive VS OV is detected and PWM1 = High (overvoltage brake conditioned by PWM1)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PASS_MOD(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PASS_MOD_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PASS_MOD_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PASS_MOD_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get Settings for bridge driver passive mode
*
*   \note  Value: 0b00b - LS1-4 are always off
*   \note  Value: 0b01b - LS1-4 are always on (static brake)
*   \note  Value: 0b10b - LS1-4 are activated if passive VS OV is detected (overvoltage break) (default)
*   \note  Value: 0b11b - LS1-4 are activated if passive VS OV is detected and PWM1 = High (overvoltage brake conditioned by PWM1)
*
*   \return PASS_MOD value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PASS_MOD(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PASS_MOD;
}

/** \brief Set Allowcation of the PWM channel 3
*
*   \note  Value: 0b000b - Allocated to HB1
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7 (default)
*   \note  Value: 0b111b - Allocated to HB8
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PWM3_HB(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PWM3_HB_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PWM3_HB_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PWM3_HB_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get Allowcation of the PWM channel 3
*
*   \note  Value: 0b000b - Allocated to HB1
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7 (default)
*   \note  Value: 0b111b - Allocated to HB8
*
*   \return PWM3_HB value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PWM3_HB(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PWM3_HB;
}

