darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set PWM channel 3 enable
*
*   \note  Value: 0b0b - PWM3 is disabled (default)
*   \note  Value: 0b1b - PWM3 is enabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PMW3_EN(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PMW3_EN_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PMW3_EN_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PMW3_EN_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get PWM channel 3 enable
*
*   \note  Value: 0b0b - PWM3 is disabled (default)
*   \note  Value: 0b1b - PWM3 is enabled
*
*   \return PMW3_EN value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PMW3_EN(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PMW3_EN;
}

/** \brief Set Allocation of the PWM channel 2
*
*   \note  Value: 0b000b - Allocated to HB1
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4 (default)
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7
*   \note  Value: 0b111b - Allocated to HB8
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PWM2_HB(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PWM2_HB_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PWM2_HB_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PWM2_HB_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get Allocation of the PWM channel 2
*
*   \note  Value: 0b000b - Allocated to HB1
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4 (default)
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7
*   \note  Value: 0b111b - Allocated to HB8
*
*   \return PWM2_HB value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PWM2_HB(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PWM2_HB;
}

/** \brief Set PWM channel 2 enable
*
*   \note  Value: 0b0b - PWM2 is disabled (default)
*   \note  Value: 0b1b - PWM2 is enabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PWM2_EN(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PWM2_EN_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PWM2_EN_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PWM2_EN_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get PWM channel 2 enable
*
*   \note  Value: 0b0b - PWM2 is disabled (default)
*   \note  Value: 0b1b - PWM2 is enabled
*
*   \return PWM2_EN value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PWM2_EN(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PWM2_EN;
}

/** \brief Set Allocation of the PWM channel 1
*
*   \note  Value: 0b000b - Allocated to HB1 (default)
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7
*   \note  Value: 0b111b - Allocated to HB8
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PWM1_HB(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PWM1_HB_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PWM1_HB_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PWM1_HB_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get Allocation of the PWM channel 1
*
*   \note  Value: 0b000b - Allocated to HB1 (default)
*   \note  Value: 0b001b - Allocated to HB2
*   \note  Value: 0b010b - Allocated to HB3
*   \note  Value: 0b011b - Allocated to HB4
*   \note  Value: 0b100b - Allocated to HB5
*   \note  Value: 0b101b - Allocated to HB6
*   \note  Value: 0b110b - Allocated to HB7
*   \note  Value: 0b111b - Allocated to HB8
*
*   \return PWM1_HB value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PWM1_HB(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PWM1_HB;
}

/** \brief Set PWM channel 1 enable
*
*   \note  Value: 0b0b - PWM1 is disabled (default)
*   \note  Value: 0b1b - PWM1 is enabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET_PWM1_EN(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWMSET.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWMSET_PWM1_EN_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWMSET_PWM1_EN_Pos) & (uint16_t)TLE9210x_Control_PWMSET_PWM1_EN_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
	#if TLE9210x_Variant == TLE92104
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Get PWM channel 1 enable
*
*   \note  Value: 0b0b - PWM1 is disabled (default)
*   \note  Value: 0b1b - PWM1 is enabled
*
*   \return PWM1_EN value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWMSET_PWM1_EN(void)
{
	return (uint16_t)TLE9210x->Control_PWMSET.bit.PWM1_EN;
}

/** \brief Set Setting of PWM channels Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWMSET(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWMSET;
		u8_success = 1;
	}
 	#if TLE9210x_Variant == TLE92104
  	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	#endif
	return u8_success;
}

/** \brief Set Deep adaptation enabled
*
*   \note  Value: 0b0b - Deep adaptation disabled (default)
*   \note  Value: 0b1b - Deep adaptation enabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_EN_DEEP_AD(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_EN_DEEP_AD_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_EN_DEEP_AD_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_EN_DEEP_AD_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Deep adaptation enabled
*
*   \note  Value: 0b0b - Deep adaptation disabled (default)
*   \note  Value: 0b1b - Deep adaptation enabled
*
*   \return EN_DEEP_AD value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_EN_DEEP_AD(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.EN_DEEP_AD;
}

/** \brief Set Enable generator check
*
*   \note  Value: 0b0b - Detection of generator mode disabled (default)
*   \note  Value: 0b1b - Detection of generator mode enabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_EN_GEN_CHECK(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_EN_GEN_CHECK_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_EN_GEN_CHECK_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_EN_GEN_CHECK_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Enable generator check
*
*   \note  Value: 0b0b - Detection of generator mode disabled (default)
*   \note  Value: 0b1b - Detection of generator mode enabled
*
*   \return EN_GEN_CHECK value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_EN_GEN_CHECK(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.EN_GEN_CHECK;
}

/** \brief Set Pre-discharge time of PWM channel 3
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPDCHG3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPDCHG3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG3_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

