darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Pre-discharge time of PWM channel 3
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPDCHG3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPDCHG3(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPDCHG3;
}

/** \brief Set Pre-charge time of PWM channel 3
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPCHG3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPCHG3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPCHG3_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPCHG3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Pre-charge time of PWM channel 3
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPCHG3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPCHG3(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPCHG3;
}

/** \brief Set Pre-discharge time of PWM channel 2
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPDCHG2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPDCHG2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG2_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Pre-discharge time of PWM channel 2
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPDCHG2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPDCHG2(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPDCHG2;
}

/** \brief Set Pre-charge time of PWM channel 2
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPCHG2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPCHG2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPCHG2_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPCHG2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Pre-charge time of PWM channel 2
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPCHG2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPCHG2(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPCHG2;
}

/** \brief Set Pre-discharge time of PWM channel 1
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPDCHG1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPDCHG1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG1_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPDCHG1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Pre-discharge time of PWM channel 1
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPDCHG1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPDCHG1(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPDCHG1;
}

/** \brief Set Pre-charge time of PWM channel 1
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG_TPCHG1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TPRECHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TPRECHG_TPCHG1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TPRECHG_TPCHG1_Pos) & (uint16_t)TLE9210x_Control_TPRECHG_TPCHG1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

