darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Pre-charge time of PWM channel 1
*
*   \note  Value: 0b00b - 125 ns (default)
*   \note  Value: 0b01b - 250 ns
*   \note  Value: 0b10b - 500 ns
*   \note  Value: 0b11b - 1000 ns
*
*   \return TPCHG1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TPRECHG_TPCHG1(void)
{
	return (uint16_t)TLE9210x->Control_TPRECHG.bit.TPCHG1;
}

/** \brief Set PWM pre-charge and pre-discharge time Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TPRECHG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TPRECHG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Level of CSA2
*
*   \note  Value: 0b0b - CSA2 is configured as low-side
*   \note  Value: 0b1b - CSA2 is configured as high-side (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_CSA2L(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_CSA2L_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_CSA2L_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_CSA2L_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Level of CSA2
*
*   \note  Value: 0b0b - CSA2 is configured as low-side
*   \note  Value: 0b1b - CSA2 is configured as high-side (default)
*
*   \return CSA2L value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_CSA2L(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.CSA2L;
}

/** \brief Set Level of CSA1
*
*   \note  Value: 0b0b - CSA1 is configured as low-side
*   \note  Value: 0b1b - CSA1 is configured as high-side (default)
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_CSA1L(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_CSA1L_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_CSA1L_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_CSA1L_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Level of CSA1
*
*   \note  Value: 0b0b - CSA1 is configured as low-side
*   \note  Value: 0b1b - CSA1 is configured as high-side (default)
*
*   \return CSA1L value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_CSA1L(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.CSA1L;
}

/** \brief Set Overcurrent filter time for CSO2
*
*   \note  Value: 0b00b - 6 µs (default)
*   \note  Value: 0b01b - 10 µs
*   \note  Value: 0b10b - 50 µs
*   \note  Value: 0b11b - 100 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_OC2FILT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_OC2FILT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_OC2FILT_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_OC2FILT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Overcurrent filter time for CSO2
*
*   \note  Value: 0b00b - 6 µs (default)
*   \note  Value: 0b01b - 10 µs
*   \note  Value: 0b10b - 50 µs
*   \note  Value: 0b11b - 100 µs
*
*   \return OC2FILT value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_OC2FILT(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.OC2FILT;
}

/** \brief Set Overcurrent filter time for CSO1
*
*   \note  Value: 0b00b - 6 µs (default)
*   \note  Value: 0b01b - 10 µs
*   \note  Value: 0b10b - 50 µs
*   \note  Value: 0b11b - 100 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_OC1FILT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_OC1FILT_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_OC1FILT_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_OC1FILT_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Overcurrent filter time for CSO1
*
*   \note  Value: 0b00b - 6 µs (default)
*   \note  Value: 0b01b - 10 µs
*   \note  Value: 0b10b - 50 µs
*   \note  Value: 0b11b - 100 µs
*
*   \return OC1FILT value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_OC1FILT(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.OC1FILT;
}

/** \brief Set Disable of CSA2
*
*   \note  Value: 0b0b - CSA2 enabled (default)
*   \note  Value: 0b1b - CSA1 disabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_CSA2_OFF(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_CSA2_OFF_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_CSA2_OFF_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_CSA2_OFF_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Disable of CSA2
*
*   \note  Value: 0b0b - CSA2 enabled (default)
*   \note  Value: 0b1b - CSA1 disabled
*
*   \return CSA2_OFF value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_CSA2_OFF(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.CSA2_OFF;
}

/** \brief Set Disable of CSA1
*
*   \note  Value: 0b0b - CSA1 enabled (default)
*   \note  Value: 0b1b - CSA1 disabled
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_CSA1_OFF(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_CSA1_OFF_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_CSA1_OFF_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_CSA1_OFF_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Disable of CSA1
*
*   \note  Value: 0b0b - CSA1 enabled (default)
*   \note  Value: 0b1b - CSA1 disabled
*
*   \return CSA1_OFF value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_CSA1_OFF(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.CSA1_OFF;
}

