darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Set Control of HB8 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB8IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB8IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB8IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB8IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Control of HB8 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB8IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB8IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB8IDIAG;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Control of HB7 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB7IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB7IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB7IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB7IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Control of HB7 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB7IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB7IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB7IDIAG;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Control of HB6 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB6IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB6IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB6IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB6IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Control of HB6 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB6IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB6IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB6IDIAG;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set Control of HB5 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB5IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB5IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB5IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB5IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Control of HB5 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB5IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB5IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB5IDIAG;
}
#endif

/** \brief Set Control of HB4 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB4IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB4IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB4IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB4IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Control of HB4 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB4IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB4IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB4IDIAG;
}

/** \brief Set Control of HB3 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB3IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB3IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB3IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB3IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Control of HB3 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB3IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB3IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB3IDIAG;
}

