darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Control of HB2 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB2IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB2IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB2IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB2IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Control of HB2 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB2IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB2IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB2IDIAG;
}

/** \brief Set Control of HB1 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG_HB1IDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_HBIDIAG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_HBIDIAG_HB1IDIAG_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_HBIDIAG_HB1IDIAG_Pos) & (uint16_t)TLE9210x_Control_HBIDIAG_HB1IDIAG_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Control of HB1 off-state current source and current sink
*
*   \note  Value: 0b0b - Pull-down deactivated (default)
*   \note  Value: 0b1b - Pull-down activated
*
*   \return HB1IDIAG value
*/
uint16_t TLE9210x_FuncLayer_get_Control_HBIDIAG_HB1IDIAG(void)
{
	return (uint16_t)TLE9210x->Control_HBIDIAG.bit.HB1IDIAG;
}

/** \brief Set Half-bridge diagnostic current control Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_HBIDIAG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_HBIDIAG;
		u8_success = 1;
	}
	return u8_success;
}

#if TLE9210x_Variant == TLE92108
/** \brief Set HB8 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 8
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 8
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB8ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB8ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB8ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB8ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB8 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 8
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 8
*
*   \return HB8ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB8ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB8ICHGST;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB7 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 7
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 7
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB7ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB7ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB7ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB7ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}
#endif

