darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get HB7 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 7
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 7
*
*   \return HB7ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB7ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB7ICHGST;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB6 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is appied to the half-bridge 6
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 6
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB6ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB6ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB6ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB6ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB6 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is appied to the half-bridge 6
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 6
*
*   \return HB6ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB6ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB6ICHGST;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Set HB5 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half=bridge 5
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 5
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB5ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB5ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB5ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB5ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get HB5 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half=bridge 5
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 5
*
*   \return HB5ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB5ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB5ICHGST;
}
#endif

/** \brief Set HB4 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 4
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 4
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB4ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB4ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB4ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB4ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get HB4 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 4
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 4
*
*   \return HB4ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB4ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB4ICHGST;
}

/** \brief Set HB3 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 3
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 3
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB3ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB3ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB3ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB3ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get HB3 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 3
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 3
*
*   \return HB3ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB3ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB3ICHGST;
}

/** \brief Set HB2 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 2
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 2
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB2ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB2ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB2ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB2ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get HB2 Selection of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 2
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 2
*
*   \return HB2ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB2ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB2ICHGST;
}

/** \brief Set HB1 Selction of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 1
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 1
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_HB1ICHGST(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_HB1ICHGST_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_HB1ICHGST_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_HB1ICHGST_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get HB1 Selction of charge and discharge currents
*
*   \note  Value: 0b0b - The static charge/discharge current 1 is applied to the half-bridge 1
*   \note  Value: 0b1b - The static charge/discharge current 2 is applied to the half-bridge 1
*
*   \return HB1ICHGST value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_HB1ICHGST(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.HB1ICHGST;
}

