darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Static gate driver charge and discharge currents 2
*
*   \note  Value: 0b0000b - Charge current: 1.0 mA | Discharge current: 1.0 mA
*   \note  Value: 0b0001b - Charge current: 2.0 mA | Discharge current: 2.8 mA
*   \note  Value: 0b0010b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0011b - Charge current: 8.0 mA | Discharge current: 9.4 mA
*   \note  Value: 0b0100b - (DEFAULT) Charge current: 12.5 mA | Discharge current: 14.2 mA
*   \note  Value: 0b0101b - Charge current: 17.8 mA | Discharge current: 19.7 mA
*   \note  Value: 0b0110b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0111b - Charge current: 30.0 mA | Discharge current: 32.0 mA
*   \note  Value: 0b1000b - Charge current: 37.1 mA | Discharge current: 39.5 mA
*   \note  Value: 0b1001b - Charge current: 44.3 mA | Discharge current: 46.8 mA
*   \note  Value: 0b1010b - Charge current: 52.3 mA | Discharge current: 54.7 mA
*   \note  Value: 0b1011b - Charge current: 60.2 mA | Discharge current: 62.5 mA
*   \note  Value: 0b1100b - Charge current: 68.3 mA | Discharge current: 70.6 mA
*   \note  Value: 0b1101b - Charge current: 76.8 mA | Discharge current: 78.5 mA
*   \note  Value: 0b1110b - Charge current: 86.0 mA | Discharge current: 87.0 mA
*   \note  Value: 0b1111b - Charge current: 96.0 mA | Discharge current: 95.0 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_ICHGST2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_ICHGST2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_ICHGST2_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_ICHGST2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Static gate driver charge and discharge currents 2
*
*   \note  Value: 0b0000b - Charge current: 1.0 mA | Discharge current: 1.0 mA
*   \note  Value: 0b0001b - Charge current: 2.0 mA | Discharge current: 2.8 mA
*   \note  Value: 0b0010b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0011b - Charge current: 8.0 mA | Discharge current: 9.4 mA
*   \note  Value: 0b0100b - (DEFAULT) Charge current: 12.5 mA | Discharge current: 14.2 mA
*   \note  Value: 0b0101b - Charge current: 17.8 mA | Discharge current: 19.7 mA
*   \note  Value: 0b0110b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0111b - Charge current: 30.0 mA | Discharge current: 32.0 mA
*   \note  Value: 0b1000b - Charge current: 37.1 mA | Discharge current: 39.5 mA
*   \note  Value: 0b1001b - Charge current: 44.3 mA | Discharge current: 46.8 mA
*   \note  Value: 0b1010b - Charge current: 52.3 mA | Discharge current: 54.7 mA
*   \note  Value: 0b1011b - Charge current: 60.2 mA | Discharge current: 62.5 mA
*   \note  Value: 0b1100b - Charge current: 68.3 mA | Discharge current: 70.6 mA
*   \note  Value: 0b1101b - Charge current: 76.8 mA | Discharge current: 78.5 mA
*   \note  Value: 0b1110b - Charge current: 86.0 mA | Discharge current: 87.0 mA
*   \note  Value: 0b1111b - Charge current: 96.0 mA | Discharge current: 95.0 mA
*
*   \return ICHGST2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_ICHGST2(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.ICHGST2;
}

/** \brief Set Static gate driver charge and discharge currents 1
*
*   \note  Value: 0b0000b - Charge current: 1.0 mA | Discharge current: 1.0 mA
*   \note  Value: 0b0001b - Charge current: 2.0 mA | Discharge current: 2.8 mA
*   \note  Value: 0b0010b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0011b - Charge current: 8.0 mA | Discharge current: 9.4 mA
*   \note  Value: 0b0100b - (DEFAULT) Charge current: 12.5 mA | Discharge current: 14.2 mA
*   \note  Value: 0b0101b - Charge current: 17.8 mA | Discharge current: 19.7 mA
*   \note  Value: 0b0110b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0111b - Charge current: 30.0 mA | Discharge current: 32.0 mA
*   \note  Value: 0b1000b - Charge current: 37.1 mA | Discharge current: 39.5 mA
*   \note  Value: 0b1001b - Charge current: 44.3 mA | Discharge current: 46.8 mA
*   \note  Value: 0b1010b - Charge current: 52.3 mA | Discharge current: 54.7 mA
*   \note  Value: 0b1011b - Charge current: 60.2 mA | Discharge current: 62.5 mA
*   \note  Value: 0b1100b - Charge current: 68.3 mA | Discharge current: 70.6 mA
*   \note  Value: 0b1101b - Charge current: 76.8 mA | Discharge current: 78.5 mA
*   \note  Value: 0b1110b - Charge current: 86.0 mA | Discharge current: 87.0 mA
*   \note  Value: 0b1111b - Charge current: 96.0 mA | Discharge current: 95.0 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG_ICHGST1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_ST_ICHG.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_ST_ICHG_ICHGST1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_ST_ICHG_ICHGST1_Pos) & (uint16_t)TLE9210x_Control_ST_ICHG_ICHGST1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Static gate driver charge and discharge currents 1
*
*   \note  Value: 0b0000b - Charge current: 1.0 mA | Discharge current: 1.0 mA
*   \note  Value: 0b0001b - Charge current: 2.0 mA | Discharge current: 2.8 mA
*   \note  Value: 0b0010b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0011b - Charge current: 8.0 mA | Discharge current: 9.4 mA
*   \note  Value: 0b0100b - (DEFAULT) Charge current: 12.5 mA | Discharge current: 14.2 mA
*   \note  Value: 0b0101b - Charge current: 17.8 mA | Discharge current: 19.7 mA
*   \note  Value: 0b0110b - Charge current: 4.5 mA | Discharge current: 5.7 mA
*   \note  Value: 0b0111b - Charge current: 30.0 mA | Discharge current: 32.0 mA
*   \note  Value: 0b1000b - Charge current: 37.1 mA | Discharge current: 39.5 mA
*   \note  Value: 0b1001b - Charge current: 44.3 mA | Discharge current: 46.8 mA
*   \note  Value: 0b1010b - Charge current: 52.3 mA | Discharge current: 54.7 mA
*   \note  Value: 0b1011b - Charge current: 60.2 mA | Discharge current: 62.5 mA
*   \note  Value: 0b1100b - Charge current: 68.3 mA | Discharge current: 70.6 mA
*   \note  Value: 0b1101b - Charge current: 76.8 mA | Discharge current: 78.5 mA
*   \note  Value: 0b1110b - Charge current: 86.0 mA | Discharge current: 87.0 mA
*   \note  Value: 0b1111b - Charge current: 96.0 mA | Discharge current: 95.0 mA
*
*   \return ICHGST1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_ST_ICHG_ICHGST1(void)
{
	return (uint16_t)TLE9210x->Control_ST_ICHG.bit.ICHGST1;
}

/** \brief Set Charge current for static half-bridges Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_ST_ICHG(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_ST_ICHG;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Set Initial precharge current of PWM Channel 3
*
*   \note  Value: 0b00000b - Charge current: 1.0 mA
*   \note  Value: 0b00001b - Charge current: 1.5 mA
*   \note  Value: 0b00010b - Charge current: 2.0 mA
*   \note  Value: 0b00011b - Charge current: 3.2 mA
*   \note  Value: 0b00100b - Charge current: 4.5 mA
*   \note  Value: 0b00101b - Charge current: 6.3 mA
*   \note  Value: 0b00110b - (DEFAULT) Charge current: 8.0 mA
*   \note  Value: 0b00111b - Charge current: 10.3 mA
*   \note  Value: 0b01000b - Charge current: 12.5 mA
*   \note  Value: 0b01001b - Charge current: 15.1 mA
*   \note  Value: 0b01010b - Charge current: 17.8 mA
*   \note  Value: 0b01011b - Charge current: 20.8 mA
*   \note  Value: 0b01100b - Charge current: 23.9 mA
*   \note  Value: 0b01101b - Charge current: 27.0 mA
*   \note  Value: 0b01110b - Charge current: 30.0 mA
*   \note  Value: 0b01111b - Charge current: 33.5 mA
*   \note  Value: 0b10000b - Charge current: 37.1 mA
*   \note  Value: 0b10001b - Charge current: 40.7 mA
*   \note  Value: 0b10010b - Charge current: 44.3 mA
*   \note  Value: 0b10011b - Charge current: 48.3 mA
*   \note  Value: 0b10100b - Charge current: 52.3 mA
*   \note  Value: 0b10101b - Charge current: 56.2 mA
*   \note  Value: 0b10110b - Charge current: 60.1 mA
*   \note  Value: 0b10111b - Charge current: 64.2 mA
*   \note  Value: 0b11000b - Charge current: 68.3 mA
*   \note  Value: 0b11001b - Charge current: 72.5 mA
*   \note  Value: 0b11010b - Charge current: 76.8 mA
*   \note  Value: 0b11011b - Charge current: 81.4 mA
*   \note  Value: 0b11100b - Charge current: 86.0 mA
*   \note  Value: 0b11101b - Charge current: 91.0 mA
*   \note  Value: 0b11110b - Charge current: 96.0 mA
*   \note  Value: 0b11111b - Charge current: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_PCHG_INIT_PCHGINIT3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_PCHG_INIT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT3_Pos) & (uint16_t)TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_PCHG_INIT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Initial precharge current of PWM Channel 3
*
*   \note  Value: 0b00000b - Charge current: 1.0 mA
*   \note  Value: 0b00001b - Charge current: 1.5 mA
*   \note  Value: 0b00010b - Charge current: 2.0 mA
*   \note  Value: 0b00011b - Charge current: 3.2 mA
*   \note  Value: 0b00100b - Charge current: 4.5 mA
*   \note  Value: 0b00101b - Charge current: 6.3 mA
*   \note  Value: 0b00110b - (DEFAULT) Charge current: 8.0 mA
*   \note  Value: 0b00111b - Charge current: 10.3 mA
*   \note  Value: 0b01000b - Charge current: 12.5 mA
*   \note  Value: 0b01001b - Charge current: 15.1 mA
*   \note  Value: 0b01010b - Charge current: 17.8 mA
*   \note  Value: 0b01011b - Charge current: 20.8 mA
*   \note  Value: 0b01100b - Charge current: 23.9 mA
*   \note  Value: 0b01101b - Charge current: 27.0 mA
*   \note  Value: 0b01110b - Charge current: 30.0 mA
*   \note  Value: 0b01111b - Charge current: 33.5 mA
*   \note  Value: 0b10000b - Charge current: 37.1 mA
*   \note  Value: 0b10001b - Charge current: 40.7 mA
*   \note  Value: 0b10010b - Charge current: 44.3 mA
*   \note  Value: 0b10011b - Charge current: 48.3 mA
*   \note  Value: 0b10100b - Charge current: 52.3 mA
*   \note  Value: 0b10101b - Charge current: 56.2 mA
*   \note  Value: 0b10110b - Charge current: 60.1 mA
*   \note  Value: 0b10111b - Charge current: 64.2 mA
*   \note  Value: 0b11000b - Charge current: 68.3 mA
*   \note  Value: 0b11001b - Charge current: 72.5 mA
*   \note  Value: 0b11010b - Charge current: 76.8 mA
*   \note  Value: 0b11011b - Charge current: 81.4 mA
*   \note  Value: 0b11100b - Charge current: 86.0 mA
*   \note  Value: 0b11101b - Charge current: 91.0 mA
*   \note  Value: 0b11110b - Charge current: 96.0 mA
*   \note  Value: 0b11111b - Charge current: 100 mA
*
*   \return PCHGINIT3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_PCHG_INIT_PCHGINIT3(void)
{
	return (uint16_t)TLE9210x->Control_PWM_PCHG_INIT.bit.PCHGINIT3;
}

/** \brief Set Initial precharge current of PWM channel 2
*
*   \note  Value: 0b00000b - Charge current: 1.0 mA
*   \note  Value: 0b00001b - Charge current: 1.5 mA
*   \note  Value: 0b00010b - Charge current: 2.0 mA
*   \note  Value: 0b00011b - Charge current: 3.2 mA
*   \note  Value: 0b00100b - Charge current: 4.5 mA
*   \note  Value: 0b00101b - Charge current: 6.3 mA
*   \note  Value: 0b00110b - (DEFAULT) Charge current: 8.0 mA
*   \note  Value: 0b00111b - Charge current: 10.3 mA
*   \note  Value: 0b01000b - Charge current: 12.5 mA
*   \note  Value: 0b01001b - Charge current: 15.1 mA
*   \note  Value: 0b01010b - Charge current: 17.8 mA
*   \note  Value: 0b01011b - Charge current: 20.8 mA
*   \note  Value: 0b01100b - Charge current: 23.9 mA
*   \note  Value: 0b01101b - Charge current: 27.0 mA
*   \note  Value: 0b01110b - Charge current: 30.0 mA
*   \note  Value: 0b01111b - Charge current: 33.5 mA
*   \note  Value: 0b10000b - Charge current: 37.1 mA
*   \note  Value: 0b10001b - Charge current: 40.7 mA
*   \note  Value: 0b10010b - Charge current: 44.3 mA
*   \note  Value: 0b10011b - Charge current: 48.3 mA
*   \note  Value: 0b10100b - Charge current: 52.3 mA
*   \note  Value: 0b10101b - Charge current: 56.2 mA
*   \note  Value: 0b10110b - Charge current: 60.1 mA
*   \note  Value: 0b10111b - Charge current: 64.2 mA
*   \note  Value: 0b11000b - Charge current: 68.3 mA
*   \note  Value: 0b11001b - Charge current: 72.5 mA
*   \note  Value: 0b11010b - Charge current: 76.8 mA
*   \note  Value: 0b11011b - Charge current: 81.4 mA
*   \note  Value: 0b11100b - Charge current: 86.0 mA
*   \note  Value: 0b11101b - Charge current: 91.0 mA
*   \note  Value: 0b11110b - Charge current: 96.0 mA
*   \note  Value: 0b11111b - Charge current: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_PCHG_INIT_PCHGINIT2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_PCHG_INIT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT2_Pos) & (uint16_t)TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_PCHG_INIT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Initial precharge current of PWM channel 2
*
*   \note  Value: 0b00000b - Charge current: 1.0 mA
*   \note  Value: 0b00001b - Charge current: 1.5 mA
*   \note  Value: 0b00010b - Charge current: 2.0 mA
*   \note  Value: 0b00011b - Charge current: 3.2 mA
*   \note  Value: 0b00100b - Charge current: 4.5 mA
*   \note  Value: 0b00101b - Charge current: 6.3 mA
*   \note  Value: 0b00110b - (DEFAULT) Charge current: 8.0 mA
*   \note  Value: 0b00111b - Charge current: 10.3 mA
*   \note  Value: 0b01000b - Charge current: 12.5 mA
*   \note  Value: 0b01001b - Charge current: 15.1 mA
*   \note  Value: 0b01010b - Charge current: 17.8 mA
*   \note  Value: 0b01011b - Charge current: 20.8 mA
*   \note  Value: 0b01100b - Charge current: 23.9 mA
*   \note  Value: 0b01101b - Charge current: 27.0 mA
*   \note  Value: 0b01110b - Charge current: 30.0 mA
*   \note  Value: 0b01111b - Charge current: 33.5 mA
*   \note  Value: 0b10000b - Charge current: 37.1 mA
*   \note  Value: 0b10001b - Charge current: 40.7 mA
*   \note  Value: 0b10010b - Charge current: 44.3 mA
*   \note  Value: 0b10011b - Charge current: 48.3 mA
*   \note  Value: 0b10100b - Charge current: 52.3 mA
*   \note  Value: 0b10101b - Charge current: 56.2 mA
*   \note  Value: 0b10110b - Charge current: 60.1 mA
*   \note  Value: 0b10111b - Charge current: 64.2 mA
*   \note  Value: 0b11000b - Charge current: 68.3 mA
*   \note  Value: 0b11001b - Charge current: 72.5 mA
*   \note  Value: 0b11010b - Charge current: 76.8 mA
*   \note  Value: 0b11011b - Charge current: 81.4 mA
*   \note  Value: 0b11100b - Charge current: 86.0 mA
*   \note  Value: 0b11101b - Charge current: 91.0 mA
*   \note  Value: 0b11110b - Charge current: 96.0 mA
*   \note  Value: 0b11111b - Charge current: 100 mA
*
*   \return PCHGINIT2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_PCHG_INIT_PCHGINIT2(void)
{
	return (uint16_t)TLE9210x->Control_PWM_PCHG_INIT.bit.PCHGINIT2;
}

