darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Discharge current for PWM Channel 3 (Active MOSFET)
*
*   \note  Value: 0b00000b - Discharge current: 1.0 mA
*   \note  Value: 0b00001b - Discharge current: 1.9 mA
*   \note  Value: 0b00010b - Discharge current: 2.8 mA
*   \note  Value: 0b00011b - Discharge current: 4.3 mA
*   \note  Value: 0b00100b - Discharge current: 5.7 mA
*   \note  Value: 0b00101b - Discharge current: 7.5 mA
*   \note  Value: 0b00110b - Discharge current: 9.4 mA
*   \note  Value: 0b00111b - (DEFAULT) Discharge current: 11.8 mA
*   \note  Value: 0b01000b - Discharge current: 14.2 mA
*   \note  Value: 0b01001b - Discharge current: 17.0 mA
*   \note  Value: 0b01010b - Discharge current: 19.7 mA
*   \note  Value: 0b01011b - Discharge current: 22.9 mA
*   \note  Value: 0b01100b - Discharge current: 26.0 mA
*   \note  Value: 0b01101b - Discharge current: 29.0 mA
*   \note  Value: 0b01110b - Discharge current: 32.0 mA
*   \note  Value: 0b01111b - Discharge current: 35.8 mA
*   \note  Value: 0b10000b - Discharge current: 39.5 mA
*   \note  Value: 0b10001b - Discharge current: 43.1 mA
*   \note  Value: 0b10010b - Discharge current: 46.8 mA
*   \note  Value: 0b10011b - Discharge current: 50.8 mA
*   \note  Value: 0b10100b - Discharge current: 54.7 mA
*   \note  Value: 0b10101b - Discharge current: 58.6 mA
*   \note  Value: 0b10110b - Discharge current: 62.5 mA
*   \note  Value: 0b10111b - Discharge current: 66.6 mA
*   \note  Value: 0b11000b - Discharge current: 70.6 mA
*   \note  Value: 0b11001b - Discharge current: 74.6 mA
*   \note  Value: 0b11010b - Discharge current: 78.5 mA
*   \note  Value: 0b11011b - Discharge current: 82.8 mA
*   \note  Value: 0b11100b - Discharge current: 87.0 mA
*   \note  Value: 0b11101b - Discharge current: 91.0 mA
*   \note  Value: 0b11110b - Discharge current: 95.0 mA
*   \note  Value: 0b11111b - Discharge current: 100 mA
*
*   \return IDCHG3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_IDCHG_ACT_IDCHG3(void)
{
	return (uint16_t)TLE9210x->Control_PWM_IDCHG_ACT.bit.IDCHG3;
}

/** \brief Set Discharge current for PWM Channel 2 (Active MOSFET)
*
*   \note  Value: 0b00000b - Discharge current: 1.0 mA
*   \note  Value: 0b00001b - Discharge current: 1.9 mA
*   \note  Value: 0b00010b - Discharge current: 2.8 mA
*   \note  Value: 0b00011b - Discharge current: 4.3 mA
*   \note  Value: 0b00100b - Discharge current: 5.7 mA
*   \note  Value: 0b00101b - Discharge current: 7.5 mA
*   \note  Value: 0b00110b - Discharge current: 9.4 mA
*   \note  Value: 0b00111b - (DEFAULT) Discharge current: 11.8 mA
*   \note  Value: 0b01000b - Discharge current: 14.2 mA
*   \note  Value: 0b01001b - Discharge current: 17.0 mA
*   \note  Value: 0b01010b - Discharge current: 19.7 mA
*   \note  Value: 0b01011b - Discharge current: 22.9 mA
*   \note  Value: 0b01100b - Discharge current: 26.0 mA
*   \note  Value: 0b01101b - Discharge current: 29.0 mA
*   \note  Value: 0b01110b - Discharge current: 32.0 mA
*   \note  Value: 0b01111b - Discharge current: 35.8 mA
*   \note  Value: 0b10000b - Discharge current: 39.5 mA
*   \note  Value: 0b10001b - Discharge current: 43.1 mA
*   \note  Value: 0b10010b - Discharge current: 46.8 mA
*   \note  Value: 0b10011b - Discharge current: 50.8 mA
*   \note  Value: 0b10100b - Discharge current: 54.7 mA
*   \note  Value: 0b10101b - Discharge current: 58.6 mA
*   \note  Value: 0b10110b - Discharge current: 62.5 mA
*   \note  Value: 0b10111b - Discharge current: 66.6 mA
*   \note  Value: 0b11000b - Discharge current: 70.6 mA
*   \note  Value: 0b11001b - Discharge current: 74.6 mA
*   \note  Value: 0b11010b - Discharge current: 78.5 mA
*   \note  Value: 0b11011b - Discharge current: 82.8 mA
*   \note  Value: 0b11100b - Discharge current: 87.0 mA
*   \note  Value: 0b11101b - Discharge current: 91.0 mA
*   \note  Value: 0b11110b - Discharge current: 95.0 mA
*   \note  Value: 0b11111b - Discharge current: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_IDCHG_ACT_IDCHG2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_IDCHG_ACT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_IDCHG_ACT_IDCHG2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_IDCHG_ACT_IDCHG2_Pos) & (uint16_t)TLE9210x_Control_PWM_IDCHG_ACT_IDCHG2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_IDCHG_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Discharge current for PWM Channel 2 (Active MOSFET)
*
*   \note  Value: 0b00000b - Discharge current: 1.0 mA
*   \note  Value: 0b00001b - Discharge current: 1.9 mA
*   \note  Value: 0b00010b - Discharge current: 2.8 mA
*   \note  Value: 0b00011b - Discharge current: 4.3 mA
*   \note  Value: 0b00100b - Discharge current: 5.7 mA
*   \note  Value: 0b00101b - Discharge current: 7.5 mA
*   \note  Value: 0b00110b - Discharge current: 9.4 mA
*   \note  Value: 0b00111b - (DEFAULT) Discharge current: 11.8 mA
*   \note  Value: 0b01000b - Discharge current: 14.2 mA
*   \note  Value: 0b01001b - Discharge current: 17.0 mA
*   \note  Value: 0b01010b - Discharge current: 19.7 mA
*   \note  Value: 0b01011b - Discharge current: 22.9 mA
*   \note  Value: 0b01100b - Discharge current: 26.0 mA
*   \note  Value: 0b01101b - Discharge current: 29.0 mA
*   \note  Value: 0b01110b - Discharge current: 32.0 mA
*   \note  Value: 0b01111b - Discharge current: 35.8 mA
*   \note  Value: 0b10000b - Discharge current: 39.5 mA
*   \note  Value: 0b10001b - Discharge current: 43.1 mA
*   \note  Value: 0b10010b - Discharge current: 46.8 mA
*   \note  Value: 0b10011b - Discharge current: 50.8 mA
*   \note  Value: 0b10100b - Discharge current: 54.7 mA
*   \note  Value: 0b10101b - Discharge current: 58.6 mA
*   \note  Value: 0b10110b - Discharge current: 62.5 mA
*   \note  Value: 0b10111b - Discharge current: 66.6 mA
*   \note  Value: 0b11000b - Discharge current: 70.6 mA
*   \note  Value: 0b11001b - Discharge current: 74.6 mA
*   \note  Value: 0b11010b - Discharge current: 78.5 mA
*   \note  Value: 0b11011b - Discharge current: 82.8 mA
*   \note  Value: 0b11100b - Discharge current: 87.0 mA
*   \note  Value: 0b11101b - Discharge current: 91.0 mA
*   \note  Value: 0b11110b - Discharge current: 95.0 mA
*   \note  Value: 0b11111b - Discharge current: 100 mA
*
*   \return IDCHG2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_IDCHG_ACT_IDCHG2(void)
{
	return (uint16_t)TLE9210x->Control_PWM_IDCHG_ACT.bit.IDCHG2;
}

