darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Maximum drive current of half-bridge mapped to PWM channel 3 during the pre-charge phase and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 18.8 mA | Discharge: 19.7 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \return ICHGMAX3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX3(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_ACT.bit.ICHGMAX3;
}

/** \brief Set Maximum drive current of half-bridge mapped to PWM channel 2 during the pre-charge phase and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 18.8 mA | Discharge: 19.7 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_ACT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Maximum drive current of half-bridge mapped to PWM channel 2 during the pre-charge phase and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 18.8 mA | Discharge: 19.7 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \return ICHGMAX2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_ACT.bit.ICHGMAX2;
}

/** \brief Set Maximum drive current of half-bridge mapped to PWM channel 1 during the pre-charge and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 18.8 mA | Discharge: 19.7 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 0u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_ACT.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Maximum drive current of half-bridge mapped to PWM channel 1 during the pre-charge and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 18.8 mA | Discharge: 19.7 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \return ICHGMAX1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_ACT.bit.ICHGMAX1;
}

/** \brief Set Max. pre-charge / pre-discharge currents for half-bridges in PWM tCCP and tBLANK setting for active MOSFETs Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_ACT;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 0)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Set Blank time -tBLANK4 Freewheeling
*
*   \note  Value: 0b000b - FW Drain-Source overvoltage blank time: 625 ns
*   \note  Value: 0b001b - FW Drain-Source overvoltage blank time: 1 µs
*   \note  Value: 0b010b - FW Drain-Source overvoltage blank time: 1.25 µs
*   \note  Value: 0b011b - FW Drain-Source overvoltage blank time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW Drain-Source overvoltage blank time: 2 µs
*   \note  Value: 0b101b - FW Drain-Source overvoltage blank time: 3 µs
*   \note  Value: 0b110b - FW Drain-Source overvoltage blank time: 4 µs
*   \note  Value: 0b111b - FW Drain-Source overvoltage blank time: 16 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

