darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Blank time -tBLANK4 Freewheeling
*
*   \note  Value: 0b000b - FW Drain-Source overvoltage blank time: 625 ns
*   \note  Value: 0b001b - FW Drain-Source overvoltage blank time: 1 µs
*   \note  Value: 0b010b - FW Drain-Source overvoltage blank time: 1.25 µs
*   \note  Value: 0b011b - FW Drain-Source overvoltage blank time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW Drain-Source overvoltage blank time: 2 µs
*   \note  Value: 0b101b - FW Drain-Source overvoltage blank time: 3 µs
*   \note  Value: 0b110b - FW Drain-Source overvoltage blank time: 4 µs
*   \note  Value: 0b111b - FW Drain-Source overvoltage blank time: 16 µs
*
*   \return TBLANK4_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.bit.TBLANK4_FW;
}

/** \brief Set Cross-current protection - tCCP4 Freewheeling
*
*   \note  Value: 0b000b - FW cross-current protection time: 375 ns
*   \note  Value: 0b001b - FW cross-current protection time: 625 ns
*   \note  Value: 0b010b - FW cross-current protection time: 1 µs
*   \note  Value: 0b011b - FW cross-current protection time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW cross-current protection time: 2 µs
*   \note  Value: 0b101b - FW cross-current protection time: 3 µs
*   \note  Value: 0b110b - FW cross-current protection time: 4 µs
*   \note  Value: 0b111b - FW cross-current protection time: 16 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Cross-current protection - tCCP4 Freewheeling
*
*   \note  Value: 0b000b - FW cross-current protection time: 375 ns
*   \note  Value: 0b001b - FW cross-current protection time: 625 ns
*   \note  Value: 0b010b - FW cross-current protection time: 1 µs
*   \note  Value: 0b011b - FW cross-current protection time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW cross-current protection time: 2 µs
*   \note  Value: 0b101b - FW cross-current protection time: 3 µs
*   \note  Value: 0b110b - FW cross-current protection time: 4 µs
*   \note  Value: 0b111b - FW cross-current protection time: 16 µs
*
*   \return TCCP4_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.bit.TCCP4_FW;
}

/** \brief Set Blank time -tBLANK3 Freewheeling
*
*   \note  Value: 0b000b - FW Drain-Source overvoltage blank time: 625 ns
*   \note  Value: 0b001b - FW Drain-Source overvoltage blank time: 1 µs
*   \note  Value: 0b010b - FW Drain-Source overvoltage blank time: 1.25 µs
*   \note  Value: 0b011b - FW Drain-Source overvoltage blank time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW Drain-Source overvoltage blank time: 2 µs
*   \note  Value: 0b101b - FW Drain-Source overvoltage blank time: 3 µs
*   \note  Value: 0b110b - FW Drain-Source overvoltage blank time: 4 µs
*   \note  Value: 0b111b - FW Drain-Source overvoltage blank time: 16 µs
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

/** \brief Get Blank time -tBLANK3 Freewheeling
*
*   \note  Value: 0b000b - FW Drain-Source overvoltage blank time: 625 ns
*   \note  Value: 0b001b - FW Drain-Source overvoltage blank time: 1 µs
*   \note  Value: 0b010b - FW Drain-Source overvoltage blank time: 1.25 µs
*   \note  Value: 0b011b - FW Drain-Source overvoltage blank time: 1.5 µs
*   \note  Value: 0b100b - (DEFAULT) FW Drain-Source overvoltage blank time: 2 µs
*   \note  Value: 0b101b - FW Drain-Source overvoltage blank time: 3 µs
*   \note  Value: 0b110b - FW Drain-Source overvoltage blank time: 4 µs
*   \note  Value: 0b111b - FW Drain-Source overvoltage blank time: 16 µs
*
*   \return TBLANK3_FW value
*/
uint16_t TLE9210x_FuncLayer_get_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW(void)
{
	return (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.bit.TBLANK3_FW;
}

/** \brief Set Maximum drive current of half-bridge mapped to PWM channel 3 during the pre-charge phase and pre-discharge phases
*
*   \note  Value: 0b00b - (DEFAULT) Charge: 19 mA | Discharge: 19 mA
*   \note  Value: 0b01b - Charge: 41 mA | Discharge: 43 mA
*   \note  Value: 0b10b - Charge: 77 mA | Discharge: 79 mA
*   \note  Value: 0b11b - Charge: 100 mA | Discharge: 100 mA
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful, 2: request successful but register bank has not the right value)
*/
uint8_t TLE9210x_FuncLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if((TLE9210x_s_deviceDriver.fp_setReg == NULL) && (TLE9210x->Control_GENCTRL1.bit.REG_BANK == 1u))
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_PWM_ICHGMAX_CCP_BLK3_FW.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3_Pos) & (uint16_t)TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_PWM_ICHGMAX_CCP_BLK3_FW;
		u8_success = 1;
	}
	else if(TLE9210x->Control_GENCTRL1.bit.REG_BANK != 1)
	{
		u8_success = 2;
	}
	else
	{
		// MISRA
	}
	return u8_success;
}

