darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Turn-on delay time of PWM Channel 1 = 62.5 x TDON1[7:0] ns
*
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF1_TDON1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TDON_OFF1.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TDON_OFF1_TDON1_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TDON_OFF1_TDON1_Pos) & (uint16_t)TLE9210x_Control_TDON_OFF1_TDON1_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Turn-on delay time of PWM Channel 1 = 62.5 x TDON1[7:0] ns
*
*
*   \return TDON1 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF1_TDON1(void)
{
	return (uint16_t)TLE9210x->Control_TDON_OFF1.bit.TDON1;
}

/** \brief Set Turn-on and turn-off delays for PWM channel 1 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF1(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF1;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Turn-off delay time of PWM Channel 2 = 62.5 x TDOFF2[7:0] ns
*
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF2_TDOFF2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TDON_OFF2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TDON_OFF2_TDOFF2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TDON_OFF2_TDOFF2_Pos) & (uint16_t)TLE9210x_Control_TDON_OFF2_TDOFF2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Turn-off delay time of PWM Channel 2 = 62.5 x TDOFF2[7:0] ns
*
*
*   \return TDOFF2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF2_TDOFF2(void)
{
	return (uint16_t)TLE9210x->Control_TDON_OFF2.bit.TDOFF2;
}

/** \brief Set Turn-on delay time of PWM Channel 2 = 62.5 x TDON2[7:0] ns
*
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF2_TDON2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TDON_OFF2.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TDON_OFF2_TDON2_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TDON_OFF2_TDON2_Pos) & (uint16_t)TLE9210x_Control_TDON_OFF2_TDON2_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Turn-on delay time of PWM Channel 2 = 62.5 x TDON2[7:0] ns
*
*
*   \return TDON2 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF2_TDON2(void)
{
	return (uint16_t)TLE9210x->Control_TDON_OFF2.bit.TDON2;
}

/** \brief Set Turn-on and turn-off delays for PWM channel 2 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF2(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF2;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Set Turn-off delay time of PWM Channel 3 = 62.5 x TDOFF3[7:0] ns
*
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3_TDOFF3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TDON_OFF3.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TDON_OFF3_TDOFF3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TDON_OFF3_TDOFF3_Pos) & (uint16_t)TLE9210x_Control_TDON_OFF3_TDOFF3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF3;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Turn-off delay time of PWM Channel 3 = 62.5 x TDOFF3[7:0] ns
*
*
*   \return TDOFF3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF3_TDOFF3(void)
{
	return (uint16_t)TLE9210x->Control_TDON_OFF3.bit.TDOFF3;
}

/** \brief Set Turn-on delay time of PWM Channel 3 = 62.5 x TDON3[7:0] ns
*
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3_TDON3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	uint16_t u16_reg_temp = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		u16_reg_temp = (uint16_t)TLE9210x->Control_TDON_OFF3.reg;
		u16_reg_temp = (uint16_t)((u16_reg_temp & (uint16_t)(~TLE9210x_Control_TDON_OFF3_TDON3_Mask)) | ((uint16_t)(u16_data << (uint16_t)TLE9210x_Control_TDON_OFF3_TDON3_Pos) & (uint16_t)TLE9210x_Control_TDON_OFF3_TDON3_Mask));
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_reg_temp;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF3;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get Turn-on delay time of PWM Channel 3 = 62.5 x TDON3[7:0] ns
*
*
*   \return TDON3 value
*/
uint16_t TLE9210x_FuncLayer_get_Control_TDON_OFF3_TDON3(void)
{
	return (uint16_t)TLE9210x->Control_TDON_OFF3.bit.TDON3;
}

