darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Set Turn-on and turn-off delays for PWM channel 3 Register
*
*   \param u16_data : value to be written
*   \return u8_success : (0: request not successful, 1: request successful)
*/
uint8_t TLE9210x_FuncLayer_set_Control_TDON_OFF3(uint16_t u16_data)
{
	uint8_t u8_success = 0;
	if(TLE9210x_s_deviceDriver.fp_setReg == NULL)
	{
		TLE9210x_s_deviceDriver.u16_setBitValue = u16_data;
		TLE9210x_s_deviceDriver.fp_setReg = &TLE9210x_RegLayer_set_Control_TDON_OFF3;
		u8_success = 1;
	}
	return u8_success;
}

/** \brief Get DS overvoltage while the bridge driver is in passive mode
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of any low-sides
*   \note  Value: 0b1b - Overvoltage on drain-source of one of the low-side is detected
*
*   \return PASS_VDSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PASS_VDSOV(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.PASS_VDSOV;
}

/** \brief Get Watchdog Monitoring
*
*   \note  Value: 0b00b - (DEFAULT) WD Timer is between [0-25%] of the WD period
*   \note  Value: 0b01b - WD Timer is between [25-50%] of the WD period
*   \note  Value: 0b10b - WD Timer is between [50-75%] of the WD period
*   \note  Value: 0b11b - WD Timer is between [75-100%] of the WD period
*
*   \return WDMON value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_WDMON(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.WDMON;
}

/** \brief Serve Watchdog function. 
 * 	\note Call this function to serve the Watchdog
*/
void TLE9210x_FuncLayer_Trigger_Watchdog(void)
{
    //Invert the Watchdog-Trigger-Bit
	if (TLE9210x_FuncLayer_get_Control_GENCTRL1_WDTRIG() == 0x01)
	{
		(void)TLE9210x_FuncLayer_set_Control_GENCTRL1_WDTRIG(0x0u);
	}
	else
	{
		(void)TLE9210x_FuncLayer_set_Control_GENCTRL1_WDTRIG(0x01);
	}
}

/** \brief Get Status of PWM3 input
*
*   \note  Value: 0b0b - (DEFAULT) PWM3 is low
*   \note  Value: 0b1b - PWM3 is high
*
*   \return PWM3STAT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM3STAT(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.PWM3STAT;
}

/** \brief Get Status of PWM2 input
*
*   \note  Value: 0b0b - (DEFAULT) PWM2 is low
*   \note  Value: 0b1b - PWM2 is high
*
*   \return PWM2STAT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM2STAT(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.PWM2STAT;
}

/** \brief Get Status of PWM1 input
*
*   \note  Value: 0b0b - (DEFAULT) PWM1 is low
*   \note  Value: 0b1b - PWM1 is high
*
*   \return PWM1STAT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_PWM1STAT(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.PWM1STAT;
}

/** \brief Get PWM channel 3 - Regulation of turn-on and turn-off delays
*
*   \note  Value: 0b0b - (DEFAULT) The turn-on delay or the turn-off delay are not in regulation
*   \note  Value: 0b1b - The turn-on and turn-off delays are in regulation
*
*   \return TDREG3 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG3(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.TDREG3;
}

/** \brief Get PWM channel 2 - Regulation of turn-on and turn-off delays
*
*   \note  Value: 0b0b - (DEFAULT) The turn-on delay or the turn-off delay are not in regulation
*   \note  Value: 0b1b - The turn-on and turn-off delays are in regulation
*
*   \return TDREG2 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG2(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.TDREG2;
}

/** \brief Get PWM channel 1 - Regulation of turn-on and turn-off delays
*
*   \note  Value: 0b0b - (DEFAULT) The turn-on delay or the turn-off delay are not in regulation
*   \note  Value: 0b1b - The turn-on and turn-off delays are in regulation
*
*   \return TDREG1 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TDREG1(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.TDREG1;
}

/** \brief Get Thermal shutdown
*
*   \note  Value: 0b0b - (DFEAULT) No thermal shutdown is detected
*   \note  Value: 0b1b - A thermal shutdown is detected
*
*   \return TSD value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TSD(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.TSD;
}

/** \brief Get Thermal Warning
*
*   \note  Value: 0b0b - (DEFAULT) No therrmal warning is detected
*   \note  Value: 0b1b - A thermal warning is detected
*
*   \return TW value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_TW(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.TW;
}

/** \brief Get Overcurrent detection of CSO2
*
*   \note  Value: 0b0b - (DEFAULT) No overcurrent detection on CSO2
*   \note  Value: 0b1b - Overcurrent detected on CSO2
*
*   \return OC2 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_OC2(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.OC2;
}

/** \brief Get Overcurrent detection of CSO1
*
*   \note  Value: 0b0b - No overcurrent detection on CSO1
*   \note  Value: 0b1b - Overcurrent detected on CSO1
*
*   \return OC1 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_OC1(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.OC1;
}

/** \brief Get VS Overvoltage
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on VS detected
*   \note  Value: 0b1b - Overvoltage on VS detected
*
*   \return VSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_VSOV(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.VSOV;
}

/** \brief Get VS Undervoltage
*
*   \note  Value: 0b0b - (DEFAULT) No undervoltage on VS detected
*   \note  Value: 0b1b - Undervoltage on VS detected
*
*   \return VSUV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_VSUV(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.VSUV;
}

/** \brief Get Charge Pump Undervoltage
*
*   \note  Value: 0b0b - (DEFAULT) No charge pump undervoltage
*   \note  Value: 0b1b - A charge pump undervoltage is detected
*
*   \return CPUV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_GENSTAT_CPUV(void)
{
	return (uint16_t)TLE9210x->Status_GENSTAT.bit.CPUV;
}

