darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on low-side 8
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 8
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 8 detected
*
*   \return LS8DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS8DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS8DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on high-side 8
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 8
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 8 detected
*
*   \return HS8DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS8DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS8DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on low-side 7
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 7
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 7 detected
*
*   \return LS7DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS7DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS7DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on high-side 7
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 7
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 7 detected
*
*   \return HS7DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS7DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS7DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on low-side 6
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 6
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 6 detected
*
*   \return LS6DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS6DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS6DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on high-side 6
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 6
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 6 detected
*
*   \return HS6DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS6DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS6DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on low-side 5
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 5
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 5 detected
*
*   \return LS5DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS5DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS5DSOV;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Drain-Source overvoltage on high-side 5
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 5
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 5 detected
*
*   \return HS5DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS5DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS5DSOV;
}
#endif

/** \brief Get Drain-Source overvoltage on low-side 4
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 4
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 4 detected
*
*   \return LS4DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS4DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS4DSOV;
}

/** \brief Get Drain-Source overvoltage on high-side 4
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 4
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 4 detected
*
*   \return HS4DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS4DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS4DSOV;
}

/** \brief Get Drain-Source overvoltage on low-side 3
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 3
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 3 detected
*
*   \return LS3DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS3DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS3DSOV;
}

/** \brief Get Drain-Source overvoltage on high-side 3
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 3
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 3 detected
*
*   \return HS3DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS3DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS3DSOV;
}

/** \brief Get Drain-Source overvoltage on low-side 2
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 2
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 2 detected
*
*   \return LS2DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS2DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS2DSOV;
}

/** \brief Get Drain-Source overvoltage on high-side 2
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 2
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 2 detected
*
*   \return HS2DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS2DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS2DSOV;
}

/** \brief Get Drain-Source overvoltage on low-side 1
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of low-side 1
*   \note  Value: 0b1b - Overvoltage on drain-source of low-side 1 detected
*
*   \return LS1DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_LS1DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.LS1DSOV;
}

/** \brief Get Drain-Source overvoltage on high-side 1
*
*   \note  Value: 0b0b - (DEFAULT) No overvoltage on drain-source of high-side 1
*   \note  Value: 0b1b - Overvoltage on drain-source of high-side 1 detected
*
*   \return HS1DSOV value
*/
uint16_t TLE9210x_FuncLayer_get_Status_DSOV_HS1DSOV(void)
{
	return (uint16_t)TLE9210x->Status_DSOV.bit.HS1DSOV;
}

