darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
#if TLE9210x_Variant == TLE92108
/** \brief Get PWM Error on HB8
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB8
*
*   \return HB8PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB8PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB8PWME;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get PWM Error on HB7
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB7
*
*   \return HB7PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB7PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB7PWME;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get PWM Error on HB6
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB6
*
*   \return HB6PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB6PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB6PWME;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get PWM Error on HB5
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB5
*
*   \return HB5PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB5PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB5PWME;
}
#endif

/** \brief Get PWM Error on HB4
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB4
*
*   \return HB4PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB4PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB4PWME;
}

/** \brief Get PWM Error on HB3
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB3
*
*   \return HB3PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB3PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB3PWME;
}

/** \brief Get PWM Error on HB2
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB2
*
*   \return HB2PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB2PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB2PWME;
}

/** \brief Get PWM Error on HB1
*
*   \note  Value: 0b0b - (DEFAULT) No PWM error
*   \note  Value: 0b1b - More than one activated PWM channels is mapped to HB1
*
*   \return HB1PWME value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB1PWME(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB1PWME;
}

#if TLE9210x_Variant == TLE92108
/** \brief Get Voltage level at SH8 when HB8MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH8|>V_VDSMONTHx if HB8D = 0 | |VCSIN1-VSH8|>V_VDSMONTHx if HB8D = 1
*   \note  Value: 0b1b - High: |VDH-VSH8| [less than] V_VDSMONTHx if HB8D = 0 | |VCSIN1-VSH8| [less than] V_VDSMONTHx if HB8D = 1
*
*   \return HB8VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB8VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB8VOUT;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Voltage level at SH7 when HB7MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH7|>V_VDSMONTHx if HB7D = 0 | |VCSIN1-VSH7|>V_VDSMONTHx if HB7D = 1
*   \note  Value: 0b1b - High: |VDH-VSH7| [less than] V_VDSMONTHx if HB7D = 0 | |VCSIN1-VSH7| [less than] V_VDSMONTHx if HB7D = 1
*
*   \return HB7VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB7VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB7VOUT;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Voltage level at SH6 when HB6MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH6|>V_VDSMONTHx if HB6D = 0 | |VCSIN1-VSH6|>V_VDSMONTHx if HB6D = 1
*   \note  Value: 0b1b - High: |VDH-VSH6| [less than] V_VDSMONTHx if HB6D = 0 | |VCSIN1-VSH6| [less than] V_VDSMONTHx if HB6D = 1
*
*   \return HB6VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB6VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB6VOUT;
}
#endif

#if TLE9210x_Variant == TLE92108
/** \brief Get Voltage level at SH5 when HB5MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH5|>V_VDSMONTHx if HB5D = 0 | |VCSIN1-VSH5|>V_VDSMONTHx if HB5D = 1
*   \note  Value: 0b1b - High: |VDH-VSH5| [less than] V_VDSMONTHx if HB5D = 0 | |VCSIN1-VSH5| [less than] V_VDSMONTHx if HB5D = 1
*
*   \return HB5VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB5VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB5VOUT;
}
#endif

/** \brief Get Voltage level at SH4 when HB4MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH4|>V_VDSMONTHx if HB4D = 0 | |VCSIN1-VSH4|>V_VDSMONTHx if HB4D = 1
*   \note  Value: 0b1b - High: |VDH-VSH4| [less than] V_VDSMONTHx if HB4D = 0 | |VCSIN1-VSH4| [less than] V_VDSMONTHx if HB4D = 1
*
*   \return HB4VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB4VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB4VOUT;
}

/** \brief Get Voltage level at SH8 when HB3MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH3|>V_VDSMONTHx if HB3D = 0 | |VCSIN1-VSH3|>V_VDSMONTHx if HB3D = 1
*   \note  Value: 0b1b - High: |VDH-VSH3| [less than] V_VDSMONTHx if HB3D = 0 | |VCSIN1-VSH3| [less than] V_VDSMONTHx if HB3D = 1
*
*   \return HB3VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB3VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB3VOUT;
}

/** \brief Get Voltage level at SH2 when HB2MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH2|>V_VDSMONTHx if HB2D = 0 | |VCSIN1-VSH2|>V_VDSMONTHx if HB2D = 1
*   \note  Value: 0b1b - High: |VDH-VSH2| [less than] V_VDSMONTHx if HB2D = 0 | |VCSIN1-VSH2| [less than] V_VDSMONTHx if HB2D = 1
*
*   \return HB2VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB2VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB2VOUT;
}

/** \brief Get Voltage level at SH1 when HB1MODE[1:0] = (0,0) or (1,1)
*
*   \note  Value: 0b0b - Low: |VDH-VSH1|>V_VDSMONTHx if HB1D = 0 | |VCSIN1-VSH1|>V_VDSMONTHx if HB1D = 1
*   \note  Value: 0b1b - High: |VDH-VSH1| [less than] V_VDSMONTHx if HB1D = 0 | |VCSIN1-VSH1| [less than] V_VDSMONTHx if HB1D = 1
*
*   \return HB1VOUT value
*/
uint16_t TLE9210x_FuncLayer_get_Status_HBVOUT_PWMERR_HB1VOUT(void)
{
	return (uint16_t)TLE9210x->Status_HBVOUT_PWMERR.bit.HB1VOUT;
}

/** \brief Get Effective MOSFET turn-off delay of PWM Channel 1 = 62.5 x TDOFF1EFF[7:0] ns
*
*
*   \return TDOFF1EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF1_TDOFF1EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF1.bit.TDOFF1EFF;
}

/** \brief Get Effective MOSFET turn-on delay of PWM Channel 1 = 62.5 x TDON1EFF[7:0] ns
*
*
*   \return TDON1EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF1_TDON1EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF1.bit.TDON1EFF;
}

