darin-noronha/motor_application/MOTOR Project/TLE9210x_FuncLayer.c
/** \brief Get Effective MOSFET turn-off delay of PWM Channel 2 = 62.5 x TDOFF2EFF[7:0] ns
*
*
*   \return TDOFF2EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF2_TDOFF2EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF2.bit.TDOFF2EFF;
}

/** \brief Get Effective MOSFET turn-on delay of PWM Channel 2 = 62.5 x TDON2EFF[7:0] ns
*
*
*   \return TDON2EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF2_TDON2EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF2.bit.TDON2EFF;
}

/** \brief Get Effective MOSFET turn-off delay of PWM Channel 3 = 62.5 x TDOFF3EFF[7:0] ns
*
*
*   \return TDOFF3EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF3_TDOFF3EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF3.bit.TDOFF3EFF;
}

/** \brief Get Effective MOSFET turn-on delay of PWM Channel 3 = 62.5 x TDON3EFF[7:0] ns
*
*
*   \return TDON3EFF value
*/
uint16_t TLE9210x_FuncLayer_get_Status_EFF_TDON_OFF3_TDON3EFF(void)
{
	return (uint16_t)TLE9210x->Status_EFF_TDON_OFF3.bit.TDON3EFF;
}

/** \brief Get MOSFET fall time of PWM Channel 1 = 62.5 x TFALL1[7:0] ns
*
*
*   \return TFALL1 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL1_TFALL1(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL1.bit.TFALL1;
}

/** \brief Get MOSFET rise time of PWM Channel 1 = 62.5 x TRISE1[7:0] ns
*
*
*   \return TRISE1 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL1_TRISE1(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL1.bit.TRISE1;
}

/** \brief Get MOSFET fall time of PWM Channel 2 = 62.5 x TFALL2[7:0] ns
*
*
*   \return TFALL2 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL2_TFALL2(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL2.bit.TFALL2;
}

/** \brief Get MOSFET rise time of PWM Channel 2 = 62.5 x TRISE2[7:0] ns
*
*
*   \return TRISE2 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL2_TRISE2(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL2.bit.TRISE2;
}

/** \brief Get MOSFET fall time of PWM Channel 3 = 62.5 x TFALL3[7:0] ns
*
*
*   \return TFALL3 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL3_TFALL3(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL3.bit.TFALL3;
}

/** \brief Get MOSFET rise time of PWM Channel 3 = 62.5 x TRISE3[7:0] ns
*
*
*   \return TRISE3 value
*/
uint16_t TLE9210x_FuncLayer_get_Status_TRISE_FALL3_TRISE3(void)
{
	return (uint16_t)TLE9210x->Status_TRISE_FALL3.bit.TRISE3;
}

#if TLE9210x_Variant == TLE92108
/** \brief Get Device derivative identifier
*
*   \note  Value: 0b000b - Reserved
*   \note  Value: 0b001b - Device: TLE92108-232
*   \note  Value: 0b010b - Reserved
*   \note  Value: 0b011b - Device: TLE92108-231
*   \note  Value: 0b100b - Reserved
*   \note  Value: 0b101b - Reserved
*   \note  Value: 0b110b - Reserved
*   \note  Value: 0b111b - Reserved
*
*   \return DEV_ID value
*/
#else
/** \brief Get Device derivative identifier
*
*   \note  Value: 0b000b - Reserved
*   \note  Value: 0b001b - Device: TLE92104-232
*   \note  Value: 0b010b - Reserved
*   \note  Value: 0b011b - Reserved
*   \note  Value: 0b100b - Reserved
*   \note  Value: 0b101b - Reserved
*   \note  Value: 0b110b - Reserved
*   \note  Value: 0b111b - Device: TLE92104-131
*
*   \return DEV_ID value
*/
#endif
uint16_t TLE9210x_FuncLayer_get_Status_DEVID_DEV_ID(void)
{
	return (uint16_t)TLE9210x->Status_DEVID.bit.DEV_ID;
}

/** @}*/ /* End of group TLE9210x_FUNCTION_LAYER */
